# Space_AddZone

## Description
Add a new Zone for the Space Object.

```pascal
PROCEDURE Space_AddZone(
				zoneType : STRING;
				zoneName : STRING);
```

```python
def vs.Space_AddZone(zoneType, zoneName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|zoneType|STRING|   |
|zoneName|STRING|   |

## Examples
```pascal
Space_AddZone('Example', 'Example');
```
```python
import vs

# Add a new Zone for the Space Object.
zoneType = 'Example'
zoneName = 'Example'

vs.Space_AddZone(zoneType, zoneName)
```

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools